preconcentrationCE/Sample_stacking/6_5sample_stacking/0/org/Phi.linear
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      Phi;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 2 -3 0 0 -1 0];

internalField   nonuniform List<scalar>

30000
(
 3.333333333333334
 3.333333333333334
 3.333333333333334
 3.333333333333334
 3.333333333333334
 3.333333333333334
 3.333333333333334
 3.333333333333334
 3.333333333333334
 3.333333333333334
 10
 10
 10
 10
 10
 10
 10
 10
 10
 10
 16.66666666666667
 16.66666666666667
 16.66666666666667
 16.66666666666667
 16.66666666666667
 16.66666666666667
 16.66666666666667
 16.66666666666667
 16.66666666666667
 16.66666666666667
 23.33333333333334
 23.33333333333334
 23.33333333333334
 23.33333333333334
 23.33333333333334
 23.33333333333334
 23.33333333333334
 23.33333333333334
 23.33333333333334
 23.33333333333334
 30
 30
 30
 30
 30
 30
 30
 30
 30
 30
 36.66666666666667
 36.66666666666667
 36.66666666666667
 36.66666666666667
 36.66666666666667
 36.66666666666667
 36.66666666666667
 36.66666666666667
 36.66666666666667
 36.66666666666667
 43.33333333333333
 43.33333333333333
 43.33333333333333
 43.33333333333333
 43.33333333333333
 43.33333333333333
 43.33333333333333
 43.33333333333333
 43.33333333333333
 43.33333333333333
 50
 50
 50
 50
 50
 50
 50
 50
 50
 50
 56.66666666666666
 56.66666666666666
 56.66666666666666
 56.66666666666666
 56.66666666666666
 56.66666666666666
 56.66666666666666
 56.66666666666666
 56.66666666666666
 56.66666666666666
 63.33333333333333
 63.33333333333333
 63.33333333333333
 63.33333333333333
 63.33333333333333
 63.33333333333333
 63.33333333333333
 63.33333333333333
...
);

boundaryField
{
    inlet
    {
        type            fixedValue; 
        value           uniform 0;
    }

    outlet
    {
        type            fixedValue;
        value           uniform 20000;
    }

    wall
    {
        type            zeroGradient;
    }
    
    front
    {
        type            wedge;
    }
    
    back
    {
        type            wedge;
    }

    axis
    {
        type            empty;
    }
}

// ************************************************************************* //
