preconcentrationCE/Sample_stacking/6_5sample_stacking/constant/electrolytes.txt
4 0.04 0.95 0 0
MES 100.0 25.0 100.0          
HISTIDINE    100. 25.0 100.0          
ARGININE     0. 0.1 0.0          
LYSINE       0.0 0.1 0.0
k1 0 0 1 2 3
A                 3.33e-7 0. 0. 
T                 -1 -1 -1  1.323e-6 0.0267 4e-4         
AT                0.0 0.0 0.0           
k1 1.21831 1.75e-3 4 5 6
